Sail2D/Runs/first_flatplate_300_18/case/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (20 0 0);

boundaryField
{
    wings
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    outlet
    {
        type            freestream;
        freestreamValue uniform (20 0 0);
        value           uniform (20 0 0);
    }
    tunnel
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    inlet
    {
        type            freestream;
        freestreamValue uniform (20 0 0);
        value           uniform (20 0 0);
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
